app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    image = post_params[:imageobject]
    image_name = image.original_filename
    @post.image_name = image.original_filename
    result = uploadimg(image,image_name)
    @post.user_id = current_user.id
    respond_to do |format|
      if result=="success" && @post.save
---
INSERT INTO "posts" ("image_name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["image_name", "img1_file578ee307d6b69.jpg"], ["user_id", 1], ["created_at", "2017-10-21 10:07:04.462211"], ["updated_at", "2017-10-21 10:07:04.462211"]]